[
    {
        "id": "epicbasketball",
        "title": "Epic Basketball",
        "url": "https://www.onlinegames.io/epic-basketball/",
        "iframe_url": "https://cloud.onlinegames.io/games/2024/shareddreams/epic-basketball/index.html",
        "thumbnail": "https://www.onlinegames.io/media/posts/1023/epic-basketball.jpg",
        "description": "Epic Basketballis a fun and quirky street-style sports game you can play right in your browser. It's all about how many baskets you can sink in just 60 seconds. If a basketball shootout game sounds too easy, think again because this hoop doesn't like to stay in one spot, and distractions are everywhere. Stay sharp, aim true, and shoot your shot!\nStart with Javi and unlock more colorful players like Plin Plin, Bubu, Patty Wally, Bruce, Alien, Neil, Imhotep and more. Each character has their own personality and look, but the real prize is Nona. She may look like a grandma, but she's the ultimate baller. To unlock Nona, you'll need to score 300 points. That's not easy, so get practicing!\nIf you enjoyed Epic Basketball's energy and fun visuals, you'll love playingBasket Random. It's a 2-player basketball game with pixel characters and fast matches. Great for when you want to take your skills to an even funnier court with wicked physics.",
        "short_description": "Play Epic Basketball online for free! Score as many baskets as you can in 60 seconds in this fun street-style basketball game.",
        "page_filename": "epicbasketball.html"
    },
    {
        "id": "geometryvibesxball",
        "title": "Geometry Vibes X-Ball",
        "url": "https://www.onlinegames.io/geometry-vibes-x-ball/",
        "iframe_url": "https://html5.gamedistribution.com/b94a8549d5b5405eb640d0b242638055/?gd_sdk_referrer_url=https://www.onlinegames.io/geometry-vibes-x-ball/",
        "thumbnail": "https://www.onlinegames.io/media/posts/1022/geometry-vibes-xball.jpg",
        "description": "Geometry Vibes: X-Ballis a platformer game where you guide a glowing ball on an obstacle course filled with some spiky traps using only one button. You'll try to keep the X-Ball alive as it zips through neon platformer levels filled with sharp corners, instant-death spikes, and giant slopes. All you can do is tap. Tap to go upwards, release to flip direction. But that's more than enough to keep your heart racing. With a slick, futuristic design, this game is a love letter to classic Geometry Dash games, modernized for today's quick-play on browsers. And we've kept the best part: you can race with your friends on the same device. Test your focus, reaction time, and sense of rhythm as a group this time. And give that one friend who always wins an award (or at least bragging rights). So tap and vibe your way through one of the slickest browser games of the year. Play Geometry Vibes: X-Ball now on OnlineGames.io!\nGeometry Vibes: X-Ball offers four game modes, each with its own structure. Let's break down how each one works so you know what to expect when you press play.\nThis is the core of the game: a single-player, level-based platformer challenge where your goal is to reach the finish line in one piece. There are 10 levels, each designed with precise layouts full of deadly spikes, angled walls, and narrow paths.\nBring your friends in for some chaotic fun! In Race Mode, up to 4 players compete locally on the same keyboard or device. Each player selects their spinner from the customization menu, choosing both skin and trail effects for visual clarity. Controls are split:\nYou'll race across the same spike-filled levels seen in Classic Mode, but now it's about survival. Fall into a spike or mess up a turn, and you lose the match. There is no respawn. The goal is to reach the end of the level first. There are 10 levels, and each one increases the chaos. This mode turns Geometry Vibes: X-Ball into a party game, perfect for school breaks, family gaming sessions, or group challenges with friends.\nThis mode is all about survival and distance. There's no ending: your job is to see how far you can go before you crash. Your score is measured in meters, and it's saved as your best record. The speed increases gradually the longer you survive, adding tension as you go. This mode is great for practicing your muscle memory.\nThis is where things get intense. You're given 5 unique levels with faster movement, tighter spaces, and shorter paths. Pressure gets even more intense here. Levels are locked behind progress, so you must beat the current one to unlock the next. The obstacles are denser here. Expect wall-to-wall spikes with minimal breathing room and fast direction changes. From normal difficulty to extreme and even \"insane\" levels, this mode will challenge even skilled gamers.\nIf you liked this game, try outGeometry Dash, another rhythm platformer game where you jump, dodge, and groove to the beat. Or loadExtreme Run 3Dand tilt and dodge your way through neon obstacles at extreme speeds. These games will scratch that itch for high-energy, sharp-reflex gameplay. The same kind that makes Geometry Vibes: X-Ball so good!",
        "short_description": "Geometry Vibes: X-Ball is a platformer game where you guide a glowing ball on an obstacle course filled with some spiky traps using only one button.",
        "page_filename": "geometryvibesxball.html"
    },
    {
        "id": "carparkingcityduel",
        "title": "Car Parking City Duel",
        "url": "https://www.onlinegames.io/car-parking-city-duel/",
        "iframe_url": "https://html5.gamedistribution.com/988495b0353c4b8b96dd92f3772bef4c/?gd_sdk_referrer_url=https://www.onlinegames.io/car-parking-city-duel/",
        "thumbnail": "https://www.onlinegames.io/media/posts/1021/car-parking-city-duel.jpg",
        "description": "Car Parking City Duelis a free online driving game where you can play solo or on split-screen with a friend. It has a 3D open-world city and combines realistic driving physics with a variety of fun game modes. So, you're not limited to just parking. This game also lets you race through traffic, drift, crash into cars, complete timed missions, and freely explore the map without rules.\nWhat makes thiscar gamestand out is how it wraps up different driving games into one big package. So, let's say you want to show off your drifting skills. There's a mode for that. Want to just roam the city and mess around? You can do that too. There's even a crash mode where smashing into other cars actually earns you points.\nYou earn coins by completing tasks or collecting money bags randomly scattered on the map. Head to the garage to unlock better, faster cars with your coins. Solo or local two-player. Mission-based or free roam. Your rules, your game. Car Parking City Duel offers something for every kind of driving fan.\nPlayer 1\nPlayer 2\nRace mode puts you on the starting line against your friend and two CPU-controlled cars. There are 10 unique tracks designed with tight corners, city traffic, and open stretches. The first to cross the finish line wins, but if you crash or fall behind early, catching up can be tough. Timing your NOS boost and cornering correctly can make all the difference.\nTest your parking precision with timed goals in 20 different realistic parking scenarios. These aren't just casual drop-offs. You'll need to maneuver around tight corners, avoid barriers, and complete the parking mission before the clock runs out. Every bump damages your car, so be gentle. Your health bar on the top right of your screen is always watching.\nThis is where things get really specific. You'll need to drive through small checkpoints and park perfectly in highlighted spots. It's a true test of control, and every level gets more complex, and the time limit shrinks. You'll need patience. You'll perform some smooth operations here.\nIn Crash Mode, your mission is to hit as many cars as possible. Every crash earns you points. And even if you slightly bump, the other cars explode. It's like playing with the tank in GTA. The more cars you explode, the more coins you'll get when the round ends. It's not about speed, but it's about destruction and smart targeting.\nSpeed through busy traffic lanes and overtake civilian cars without crashing. Each overtake adds to your score so you can drive with better sports cars in the next run. It's one of the most rewarding modes of all.\nSpeed over 80 km and steer sharply to pull off long drifts around corners and collect drift points. You'll need smooth entries, tight control, and the ability to maintain your angle without slamming into walls. Rack up a high score and prove your drifting skills. If you need a guide on how to drift, read our article on drift games online.\nNo goals. No pressure. Just you and the city. Drive wherever you want, explore ramps, jump off rooftops, take in the scenery, or practice tricks. This mode is great for experimenting or just relaxing between intense challenges. If you want, collect some money bags on the street.\nCar Parking City Duel was developed by RHM Interactive, known for making competitive and co-op games perfect for browser play. They've mastered the split-screen formula, and it shows here that every mode feels tailor-made for two players or solo fun.\nIf you enjoy city driving in Car Parking City Duel, you'll want to try othertraffic gamesorparking gameson OnlineGames.io. We have lots of titles, each offering a unique urban driving experience, letting you explore the city while completing stunts, missions, or simply cruising with realistic traffic. They're all playable online for free. So fuel up, grab a friend, and hit the road.Â",
        "short_description": "Car Parking City Duel is a free 3D driving game with solo and 2-player modes. Race, drift, park, crash, and explore the city!",
        "page_filename": "carparkingcityduel.html"
    },
    {
        "id": "ultimatemoto",
        "title": "Ultimate Moto",
        "url": "https://www.onlinegames.io/ultimate-moto/",
        "iframe_url": "https://cloud.onlinegames.io/games/2021/2/ultimate-moto/index-og.html",
        "thumbnail": "https://www.onlinegames.io/media/posts/1020/ultimate-moto.jpg",
        "description": "Does gaming feel overwhelming lately? Big-budget titles flood us with complex controls, hundreds of features, and graphics so detailed they're exhausting to follow. Sometimes you end up feeling stressed just trying to keep up instead of feeling relaxed.\nIn all that noise, what many of us truly crave is the simplicity ofarcade mechanics. Think of Pac-Man. Pure addictive fun that stands for decades. When the core is fun, the game doesn't need a fancy package. So sometimes, the best online games are the ones that are easy on the eyes, quick to learn, and instantly fun to play.\nUltimate Motowas created exactly with this kind of mentality. This game strips gaming back down to the basics with its minimalist neon visuals, sharp and clean lines, and easy mechanics. Forget 5 different kinds of in-game coins, menus packed with hundreds of confusing options, endless tutorials, or overly complex storylines. Here, it's all about getting right onto the neon-lit track and controlling your bike with arrow keys. And enjoying smooth jumps and satisfying flips.\nIf you're looking for a break from the gaming clutter, Ultimate Moto provides what you've been looking for. This fun little game throws you into a glowing track full of loops, ramps, and sparkly gems to collect. Choose your bike, upgrade your engine, and zoom through challenging levels with style. Each level is a new obstacle course, and your goal is to stay upright on the bike. Hit start, speed ahead, and reach the finish line without crashing.\nYour mission is to reach the finish line without tipping over. Along the way, grab as many diamonds as you can. These gems are your currency to buy new bikes and engine upgrades. Each level gets a bit trickier, with steeper hills, longer jumps, and tighter timing. If you flip in the air, you get an extra three diamonds. And if you crash, just restart instantly and try that level again.\nWASD or arrow keys to move.\nUltimate Moto is developed by FreezeNova Games and released in 2021.\nIf Ultimate Moto brings back that feeling for you, let us know! Drop a comment, tell us how far you've made it, or which neon bike is your favorite. We'd love to hear your thoughts. And if you enjoyed Ultimate Moto, have a look at the otherfree bike gameswe have on OnlineGames.io . We publish new games each week. So bookmark this site and don't miss out on new games.Â",
        "short_description": "Race through glowing tracks in Ultimate Moto, free online bike game on OnlineGames.io!",
        "page_filename": "ultimatemoto.html"
    },
    {
        "id": "gtcarscityracing",
        "title": "GT Cars City Racing",
        "url": "https://www.onlinegames.io/gt-cars-city-racing/",
        "iframe_url": "https://html5.gamedistribution.com/60a97d022db7432eb82dd30fa7938e03/?gd_sdk_referrer_url=https://www.onlinegames.io/gt-cars-city-racing/",
        "thumbnail": "https://www.onlinegames.io/media/posts/1019/gt-cars-city-racing.jpg",
        "description": "GT Cars City Racingis a fun 3D driving game where you can race solo or compete with a friend in split-screen mode. The game packs up everything you love in car games: super sport GT cars, a sandbox mode with a great playground, head-to-head races and robot wars!\nIn the sandbox mode, which is called Toy City, you drive through a colorful sandbox filled with fun mini-games like knocking over bowling pins, smashing robots, or jumping into pools. Face to Face is a competitive race mode where your car changes every lap, challenging you to adapt quickly and finish all five laps before your rivals. Mega Ramps throws you into a time-based race where a giant robot tries to destroy your car as you speed down massive ramps. GT Cars City Racing also lets you customize your GT car with different colors and effects. You can even paint the rims! With its bright 3D visuals, wild stunts, quick load times and fun challenges, GT Cars City Racing will be your next obsession!\nPlayer 1:\nPlayer 2:\nThere are three different game modes + customization garage in the GT Cars City Racing.Â\nThis is where the real fun begins. Toy City is a sandbox-style mode full of short missions and mini-games. The entire map feels like a giant toy playset! Each mission in Toy City is designed to be quick, fun, and physics-based. These missions are all about experimenting, having fun, and earning money while doing fun stunts. You can play them at your own pace and replay your favorites. It's the perfect mode if you want to take a break from racing and just goof around in a fun, colorful world. Here's what you can expect:\nReady for a proper race? In this mode, you'll speed toward the finish line, and once you reach it, you'll switch cars (like a truck, mini SUV, or sports car), and your next lap begins instantly. You'll go through 5 vehicle swaps. First to complete all 5 wins!\nIn this time trial race mode, you drive down massive ramps while a giant robot tries to stop you. It might throw stuff at you or damage your car directly. If your health bar hits zero, your car falls off the edge or time runs out, you're out! Can you survive this madness and cross the finish line?\nIf you want a fiery red GT over a glowing blue sports car with neon rims, it's all here. Now, head to the Customize tab on main menu and make your car look exactly how you want. You can:\nGT Cars City Racing is created by GameVGames, known for bright, accessible, and over-the-top driving games.Â\nIf you're into stunt driving and arcade-style races, you'll loveCrazy Car Arena. It features massive jumps, tricky obstacle tracks, and weirdly fun cars to unlock. Perfect for fans of Mega Ramps or Toy City mayhem! With fun toylike maps, lots of game modes, and two player split-screen feature, GT Cars City Racing is your new go-to browser game for laughs, races, and stunt madness. So buckle up, customize your ride, and play it free now on OnlineGames.io!",
        "short_description": "Buckle up, customize your ride, and play GT Cars City Racing for free now on OnlineGames.io!",
        "page_filename": "gtcarscityracing.html"
    },
    {
        "id": "thesmurfscooking",
        "title": "The Smurfs Cooking",
        "url": "https://www.onlinegames.io/the-smurfs-cooking/",
        "iframe_url": "https://html5.gamedistribution.com/ec7df258c06147e6a5b2325ee02cf5b3/?gd_sdk_referrer_url=https://www.onlinegames.io/the-smurfs-cooking/",
        "thumbnail": "https://www.onlinegames.io/media/posts/1018/the-smurfs-cooking.jpg",
        "description": "The Smurfs are back, and this time, they are in the kitchen! The Smurfs Cooking is a fun cooking game where you help Chef Smurf whip up the best cupcakes and snacks for the annual Smurf Food Festival. But he's in a bit of a smurfy pickle. He hasn't thought of a recipe yet! So it's up to you to jump behind the counter, serve hungry Smurfs, and keep the food flowing before the timer runs out.\nIf you lovecooking gamesor just want to hang out with your favorite little blue friends, this sweet challenge will have you hooked. Muffins, whipped cream, juice, and cupcakesâ¦ it's all here!\nThe Smurfs Cooking is officially licensed by IMPS and Peyo, the creators of The Smurfs. The game keeps true to the charm and family-friendly feel of the original series while adding exciting gameplay for fans of all ages. If you like the Smurf theme, next play theThe Smurfs Village Cleaning.",
        "short_description": "Cook, top, and serve your way to victory! You can play The Smurfs Cooking online for free right now on OnlineGames.io!",
        "page_filename": "thesmurfscooking.html"
    },
    {
        "id": "swordplayninjaslicerunner",
        "title": "Sword Play Ninja Slice Runner",
        "url": "https://www.onlinegames.io/sword-play-ninja-slice-runner/",
        "iframe_url": "https://html5.gamedistribution.com/f37e6802a81944d7bbe172e496b79eb9/?gd_sdk_referrer_url=https://www.onlinegames.io/sword-play-ninja-slice-runner/",
        "thumbnail": "https://www.onlinegames.io/media/posts/1016/sword-play.jpg",
        "description": "Grab your katana and get ready to slice your way through waves of enemies!ÂSword Play Ninja Slice Runneris an action runner game where you become a blade-wielding ninja on a high platform filled with enemies. You'll be slicing flying shurikens, bullets, shields or dodging massive bullets, just with your fingers moving.\nThe game throws you into a simple but colorful 3D world that changes in each level. Complete sword fights, slicing action, and enjoy satisfying slow-motion effects. Itâs a mix of Fruit Ninjaâs slicing satisfaction and the fun of endless runners.\nOne of the coolest parts of Sword Play! Ninja Slice Runner is the wide range of sword skins and trail effects you can unlock in the shop. They make your slicing feel even more fun and rewarding. Hereâs what youâll find:\nYou can unlock random swords with 700 coins or collect specific ones by leveling up or completing challenges. Change up your blade with unique weapons, from classic katanas to quirky alternatives:\nLeave a mark, literally. Leave a trail when you swing your sword. These visual effects make every attack more exciting, especially during slow-mo moments.Trails add an extra flair to every slash. Unlock them in the shop and have trail effects like:\nTip: Trails donât change gameplay but they do make every hit more stylish and VR-like experience. Try combining swords and trails to match your ninja vibe!\nSword Play! Ninja Slice Runner game was developed by PlayGama for quick fun.Â\nIf you're craving more stealthy swordplay, check outBlocky Parkour Ninja. Itâs a 3D ninja platformer where you sneak through enemy bases, dodge traps with swift precision. With its blocky visuals and fun gameplay, itâs a great pick for players who enjoyninja games online.",
        "short_description": "Play Sword Play! Ninja Slice Runner online! Slice enemies, dodge traps, and unlock epic swords and trails.",
        "page_filename": "swordplayninjaslicerunner.html"
    },
    {
        "id": "redlightgreenlight",
        "title": "Red Light Green Light",
        "url": "https://www.onlinegames.io/red-light-green-light/",
        "iframe_url": "https://html5.gamedistribution.com/788f89d325d840f391139ce0e1212c46/?gd_sdk_referrer_url=https://www.onlinegames.io/red-light-green-light/",
        "thumbnail": "https://www.onlinegames.io/media/posts/1017/red-light-green-light.jpg",
        "description": "Red Light Green Lightis a game from the famous TV series Squid Game, and it is definitely one of the most iconic scenes. In this children game, players stand behind a starting line and must reach a finish line at the far end of the field. A giant, creepy doll stands at the finish line. It turns its back to the players and says \"Green light!\" This means players can move. Then, when it suddenly says \"Red light!\" and turns around. And players must freeze immediately. If the doll sees someone still moving during \"Red light,\" that player is eliminated (and in Squid Game, elimination is done by shooting the player).\nIn this online video game version ofRed Light Green Lighton OnlineGames.io, you'll be put in the tracksuit of a numbered contestant and dropped into a deadly playground. Movement can mean either survival or death. Nothing in between. So hit the play button and enjoy the same thrill 456 lived in the first episode!\nThis game is a fan-made experience created in the spirit of Squid Game, designed for quick, casual fun. With a clean design and responsive movement, it's easy to pick up and play on your browser.\nIf you liked the tension and timing of Red Light Green Light, check outSquid Shooteron OnlineGames.io. It brings the Squid Game characters with a goofy style. Feel free to explore all other popularfree gameson our site.Â",
        "short_description": "Play Squid Race Simulator online, a video game inspired by Red Light, Green Light of Squid Game! ",
        "page_filename": "redlightgreenlight.html"
    },
    {
        "id": "apocalypsetruck",
        "title": "Apocalypse Truck",
        "url": "https://www.onlinegames.io/apocalypse-truck/",
        "iframe_url": "https://cloud.onlinegames.io/games/2021/1/apocalypse-truck/index-og.html",
        "thumbnail": "https://www.onlinegames.io/media/posts/1015/apocalypse-truck.jpg",
        "description": "When the virus hit, cities crumbled, people vanished. The world went silent except for the groans of the undead. Youâre one of the few survivors of zombie apocalypse. Your only hope is a beat-up monster truck, with some spikes, plates, and just enough horsepower to push through the zombie chaos. This is your last chance to escape the city ruins. Fuel up, slam the pedal, and drive through waves of the undead in this thrilling side-scrolling zombie survival game!\nApocalypse Truckis a 2Ddriving gamewhere you roam in a post apocalypse town, run over zombies and race to the finish line. Besides surviving the zombie apocalypse with wheels, spikes you will also launch off wrecked cars, perform mid air flips and and grab coins as you go. Are you into monster truck flips? Destruction? Flattening some zombies? Ok, don't wait! Start playing this fun game on our browser.\nApocalypse Truck is developed by FreezeNova. Theyâre known for making fast and fun games that play great in your browser.\nIf you loved running over zombies in Apocalypse Truck, itâs time to switch gears and try a slower but deadlier style. TryZombie Sniper. In this 2D shooting game, you take your position on a rooftop with a sniper rifle and aim for zombie heads. Each shot needs to be perfect. With 30 levels of zombie action, itâs a different kind ofzombie game online!",
        "short_description": "Play Apocalypse Truck for free now on OnlineGames.io Smash the undead, flip for extra rewards, and survive the zombie waves!",
        "page_filename": "apocalypsetruck.html"
    },
    {
        "id": "pacxonnewrealms",
        "title": "PacXon New Realms",
        "url": "https://www.onlinegames.io/pacxon-new-realms/",
        "iframe_url": "https://html5.gamedistribution.com/727e29ac2f7a40e69a17dc7ff7f4c306/?gd_sdk_referrer_url=https://www.onlinegames.io/pacxon-new-realms/",
        "thumbnail": "https://www.onlinegames.io/media/posts/1014/PaxCon-New-REalms.jpg",
        "description": "Remember Paxcon? The classic wall-closing puzzle from the 2000s?.\nIf the answer is a big yes, the wait is over my friend, becausePacXon: New Realmsis here now. And it's out and bolder than ever. In this sequel to arcade classic PacXon Deluxe, with a full-on expansion loaded with new realms, enemies, skins, and power-ups, you'll get that pixelated fun with a modern twist.\nConquer by drawing walls, dodge tricky mines, and carve out territory with style. It's part strategy, part action, and all satisfying (especially when you trap those pesky enemies in a corner and watch the progress bar tick up to 80%.) In case you're new to world of PacXon, hereâs a quick Arcade 101 refresher:\nPacXon (sometimes written as Pac-Xon) is a fun arcade-style puzzle game that mixes mechanics from classic games like Pac-Man and Xonix. In thisfun game, you play as Pacxon, a little PacMan-like character, but instead of eating dots, your goal is to fill up the screen by building walls. As you move, Pacxon leaves a trail behind him. If you can successfully close off a section of the screen, that area becomes filled in. The goal is to fill at least 80% of the screen to complete the level. PacXon was originally aFlash gamereleased in 2007, but 18 years later, an HTML5 version was published so it can be played online without plugins.\nYour goal is to capture at least 80% of the field to move on. Yellow dots are shared open spaces, and orange dots are your territory. At the beginning of the level, all four sides are yours. You will run over open space to create a wall trail and loop back to a captured area to close the trail and claim that section. Then, it will turn into orange dots, marking your territory.\nIf an enemy touches you or your trail before you finish the loop, you lose a life. Keep track of your lives on the bottom left. Keep an eye on the progress bar at the top to know how close you are to finishing the level.\nEach level features ghostly enemies with different movement patterns. You'll need to study their patterns and strike at the right moment to grab territory without losing lives.\nCollect sweet treats on the map for powerful boosts:\nPacXon: New Realms is the official sequel to the beloved PacXon Deluxe. This upgraded version brings back the old-school challenge with a fresh look. It's distributed by Azerion Casual Games. You can play it online for free now at OnlineGames.io.\nLove the blend of retro vibes and quick reactions? TryPac-Man 30th Anniversary. It's a faithful tribute to the dot-munching, ghost-dodging original, now updated for browser play. It's perfect for fans of maze strategies and classic tension. Google PacMan is a full-blown pixel quest that's equal parts nostalgic and new. Play now!",
        "short_description": "Pacxon is a fun arcade-style puzzle game that mixes mechanics from classic games like Pac-Man and Xonix. ",
        "page_filename": "pacxonnewrealms.html"
    },
    {
        "id": "crazymotorcycle",
        "title": "Crazy Motorcycle",
        "url": "https://www.onlinegames.io/crazy-motorcycle/",
        "iframe_url": "https://html5.gamedistribution.com/30637801603e46ec82b342b77f539cf3/?gd_sdk_referrer_url=https://www.onlinegames.io/crazy-motorcycle/",
        "thumbnail": "https://www.onlinegames.io/media/posts/1013/Crazy-Motorcycle.jpg",
        "description": "If Minecraft ever had a wild cousin who ditched mining for motorbikes,Crazy Motorcyclewould be it. In this crazy bike game, you'll take a Minecraft-style noob (we call him Nubik), give him a shiny motorcycle, and drop into a floating obstacle course in the sky. There are no roads, no rules, and definitely no safety rails. Just pure blocky platformer. That's the energy this game brings.\nIt's almost like a kid built a racetrack in creative mode, added a few too many stone walls and trees, and then dared you to race through it with a bike. You'll recognize the pixelated grass blocks, chunky trees, mossy stone pillars, ice blocks and floating islands. Even though the theme feels like it's pulled straight out of aMinecraftserver, there's no building or mining mode here. Your job is to dodge, jump, and reach the red portal at the end of the level. And there's something extra funny about seeing this square-headed daredevil wipe out in the most dramatic ways. So start playing Crazy Motorcycle now, and then you'll want to play again and again.\nPC:\nMobile:\nCrazy Motorcycle is a browser-based platformer game built by AM-Games. If you've played other \"Noob\" or voxel racing titles, you'll feel right at home. The developers focused on making a challenging but playful experience with short levels and instant retries.\nIf Crazy Motorcycle grabbed your attention, tryObby But You're on a Bike. It's another sky adventure where you ride and jump and try not to fall off platforms. But this time, it has aRoblox-inspiredtheme instead of Minecraft. Perfect if you enjoy stunt games with a side of comedy.",
        "short_description": "Play Crazy Motorcycle for free on OnlineGames.io and see how far your noob biker can go before gravity wins.",
        "page_filename": "crazymotorcycle.html"
    },
    {
        "id": "kickthepirate",
        "title": "Kick the Pirate",
        "url": "https://www.onlinegames.io/kick-the-pirate/",
        "iframe_url": "https://cloud.onlinegames.io/games/2022/construct/92/kick-the-pirate/index-og.html",
        "thumbnail": "https://www.onlinegames.io/media/posts/1012/Kick-The-Pirate.jpg",
        "description": "Ahoy matey! Pirates may be brave on the high seas, but theyâve never met you. InKick the Pirate, your job is simple: turn this grumpy pirate into your personal punching bag.Â  Heâs muttering curses or just standing there looking smug. But itâs oddly satisfying to send him flying with a cannonball. Seriously. Bad day at school? Boss annoyed you? This destroy game is the perfect way to blow off some steam without flipping a table.\nSome games make you think. Others make you feel. And this one? It just lets you kick a pirate with a cannon. And honestly, thatâs all we needed today. In case you still have some steam left to blow off, we have a full collection of dummy games. You cankick the alienwho tries to colonize your planet with some laser guns and sci-fi weapons. Or perhaps you may want tobeat an Evil Santawho keeps the gifts to himself instead of giving them away. Oh, you still need more? Write \"Kick the\" in the search bar or go and explore alldestroying gameswe have!Â Â\nThere are tons of wacky weapons to unlock, each more satisfying than the last. You can switch between weapons using the buttons at the top of the screen. The stronger your weapons, the faster you can rack up coins and complete levels.\nKick the Pirate was developed by FreezeNova with casual fun in mind. While it doesnât take itself seriously, it delivers a surprisingly satisfying gameplay loop perfect for quick sessions or all-out pirate punishment marathons.\nWhile Kick the Pirate uses cartoon-style visuals and lets you toggle off blood effects, parents should know the core gameplay revolves around violence toward a pirate character. Itâs meant to be humorous and exaggerated, not realistic. Recommended for players 10 and up with parental guidance if needed.",
        "short_description": "Play Kick the Pirate online for free at OnlineGames.io",
        "page_filename": "kickthepirate.html"
    }
]