[
    {
        "id": "epicbasketball",
        "title": "Epic Basketball",
        "url": "https://www.onlinegames.io/epic-basketball/",
        "iframe_url": "https://cloud.onlinegames.io/games/2024/shareddreams/epic-basketball/index.html",
        "thumbnail": "https://www.onlinegames.io/media/posts/1023/epic-basketball.jpg",
        "description": "Epic Basketballis a fun and quirky street-style sports game you can play right in your browser. It's all about how many baskets you can sink in just 60 seconds. If a basketball shootout game sounds too easy, think again because this hoop doesn't like to stay in one spot, and distractions are everywhere. Stay sharp, aim true, and shoot your shot!\nStart with Javi and unlock more colorful players like Plin Plin, Bubu, Patty Wally, Bruce, Alien, Neil, Imhotep and more. Each character has their own personality and look, but the real prize is Nona. She may look like a grandma, but she's the ultimate baller. To unlock Nona, you'll need to score 300 points. That's not easy, so get practicing!\nIf you enjoyed Epic Basketball's energy and fun visuals, you'll love playingBasket Random. It's a 2-player basketball game with pixel characters and fast matches. Great for when you want to take your skills to an even funnier court with wicked physics.",
        "short_description": "Play Epic Basketball online for free! Score as many baskets as you can in 60 seconds in this fun street-style basketball game.",
        "page_filename": "epicbasketball.html"
    },
    {
        "id": "geometryvibesxball",
        "title": "Geometry Vibes X-Ball",
        "url": "https://www.onlinegames.io/geometry-vibes-x-ball/",
        "iframe_url": "https://html5.gamedistribution.com/b94a8549d5b5405eb640d0b242638055/?gd_sdk_referrer_url=https://www.onlinegames.io/geometry-vibes-x-ball/",
        "thumbnail": "https://www.onlinegames.io/media/posts/1022/geometry-vibes-xball.jpg",
        "description": "Geometry Vibes: X-Ballis a platformer game where you guide a glowing ball on an obstacle course filled with some spiky traps using only one button. You'll try to keep the X-Ball alive as it zips through neon platformer levels filled with sharp corners, instant-death spikes, and giant slopes. All you can do is tap. Tap to go upwards, release to flip direction. But that's more than enough to keep your heart racing. With a slick, futuristic design, this game is a love letter to classic Geometry Dash games, modernized for today's quick-play on browsers. And we've kept the best part: you can race with your friends on the same device. Test your focus, reaction time, and sense of rhythm as a group this time. And give that one friend who always wins an award (or at least bragging rights). So tap and vibe your way through one of the slickest browser games of the year. Play Geometry Vibes: X-Ball now on OnlineGames.io!\nGeometry Vibes: X-Ball offers four game modes, each with its own structure. Let's break down how each one works so you know what to expect when you press play.\nThis is the core of the game: a single-player, level-based platformer challenge where your goal is to reach the finish line in one piece. There are 10 levels, each designed with precise layouts full of deadly spikes, angled walls, and narrow paths.\nBring your friends in for some chaotic fun! In Race Mode, up to 4 players compete locally on the same keyboard or device. Each player selects their spinner from the customization menu, choosing both skin and trail effects for visual clarity. Controls are split:\nYou'll race across the same spike-filled levels seen in Classic Mode, but now it's about survival. Fall into a spike or mess up a turn, and you lose the match. There is no respawn. The goal is to reach the end of the level first. There are 10 levels, and each one increases the chaos. This mode turns Geometry Vibes: X-Ball into a party game, perfect for school breaks, family gaming sessions, or group challenges with friends.\nThis mode is all about survival and distance. There's no ending: your job is to see how far you can go before you crash. Your score is measured in meters, and it's saved as your best record. The speed increases gradually the longer you survive, adding tension as you go. This mode is great for practicing your muscle memory.\nThis is where things get intense. You're given 5 unique levels with faster movement, tighter spaces, and shorter paths. Pressure gets even more intense here. Levels are locked behind progress, so you must beat the current one to unlock the next. The obstacles are denser here. Expect wall-to-wall spikes with minimal breathing room and fast direction changes. From normal difficulty to extreme and even \"insane\" levels, this mode will challenge even skilled gamers.\nIf you liked this game, try outGeometry Dash, another rhythm platformer game where you jump, dodge, and groove to the beat. Or loadExtreme Run 3Dand tilt and dodge your way through neon obstacles at extreme speeds. These games will scratch that itch for high-energy, sharp-reflex gameplay. The same kind that makes Geometry Vibes: X-Ball so good!",
        "short_description": "Geometry Vibes: X-Ball is a platformer game where you guide a glowing ball on an obstacle course filled with some spiky traps using only one button.",
        "page_filename": "geometryvibesxball.html"
    },
    {
        "id": "carparkingcityduel",
        "title": "Car Parking City Duel",
        "url": "https://www.onlinegames.io/car-parking-city-duel/",
        "iframe_url": "https://html5.gamedistribution.com/988495b0353c4b8b96dd92f3772bef4c/?gd_sdk_referrer_url=https://www.onlinegames.io/car-parking-city-duel/",
        "thumbnail": "https://www.onlinegames.io/media/posts/1021/car-parking-city-duel.jpg",
        "description": "Car Parking City Duelis a free online driving game where you can play solo or on split-screen with a friend. It has a 3D open-world city and combines realistic driving physics with a variety of fun game modes. So, you're not limited to just parking. This game also lets you race through traffic, drift, crash into cars, complete timed missions, and freely explore the map without rules.\nWhat makes thiscar gamestand out is how it wraps up different driving games into one big package. So, let's say you want to show off your drifting skills. There's a mode for that. Want to just roam the city and mess around? You can do that too. There's even a crash mode where smashing into other cars actually earns you points.\nYou earn coins by completing tasks or collecting money bags randomly scattered on the map. Head to the garage to unlock better, faster cars with your coins. Solo or local two-player. Mission-based or free roam. Your rules, your game. Car Parking City Duel offers something for every kind of driving fan.\nPlayer 1\nPlayer 2\nRace mode puts you on the starting line against your friend and two CPU-controlled cars. There are 10 unique tracks designed with tight corners, city traffic, and open stretches. The first to cross the finish line wins, but if you crash or fall behind early, catching up can be tough. Timing your NOS boost and cornering correctly can make all the difference.\nTest your parking precision with timed goals in 20 different realistic parking scenarios. These aren't just casual drop-offs. You'll need to maneuver around tight corners, avoid barriers, and complete the parking mission before the clock runs out. Every bump damages your car, so be gentle. Your health bar on the top right of your screen is always watching.\nThis is where things get really specific. You'll need to drive through small checkpoints and park perfectly in highlighted spots. It's a true test of control, and every level gets more complex, and the time limit shrinks. You'll need patience. You'll perform some smooth operations here.\nIn Crash Mode, your mission is to hit as many cars as possible. Every crash earns you points. And even if you slightly bump, the other cars explode. It's like playing with the tank in GTA. The more cars you explode, the more coins you'll get when the round ends. It's not about speed, but it's about destruction and smart targeting.\nSpeed through busy traffic lanes and overtake civilian cars without crashing. Each overtake adds to your score so you can drive with better sports cars in the next run. It's one of the most rewarding modes of all.\nSpeed over 80 km and steer sharply to pull off long drifts around corners and collect drift points. You'll need smooth entries, tight control, and the ability to maintain your angle without slamming into walls. Rack up a high score and prove your drifting skills. If you need a guide on how to drift, read our article on drift games online.\nNo goals. No pressure. Just you and the city. Drive wherever you want, explore ramps, jump off rooftops, take in the scenery, or practice tricks. This mode is great for experimenting or just relaxing between intense challenges. If you want, collect some money bags on the street.\nCar Parking City Duel was developed by RHM Interactive, known for making competitive and co-op games perfect for browser play. They've mastered the split-screen formula, and it shows here that every mode feels tailor-made for two players or solo fun.\nIf you enjoy city driving in Car Parking City Duel, you'll want to try othertraffic gamesorparking gameson OnlineGames.io. We have lots of titles, each offering a unique urban driving experience, letting you explore the city while completing stunts, missions, or simply cruising with realistic traffic. They're all playable online for free. So fuel up, grab a friend, and hit the road.Â",
        "short_description": "Car Parking City Duel is a free 3D driving game with solo and 2-player modes. Race, drift, park, crash, and explore the city!",
        "page_filename": "carparkingcityduel.html"
    },
    {
        "id": "ultimatemoto",
        "title": "Ultimate Moto",
        "url": "https://www.onlinegames.io/ultimate-moto/",
        "iframe_url": "https://cloud.onlinegames.io/games/2021/2/ultimate-moto/index-og.html",
        "thumbnail": "https://www.onlinegames.io/media/posts/1020/ultimate-moto.jpg",
        "description": "Does gaming feel overwhelming lately? Big-budget titles flood us with complex controls, hundreds of features, and graphics so detailed they're exhausting to follow. Sometimes you end up feeling stressed just trying to keep up instead of feeling relaxed.\nIn all that noise, what many of us truly crave is the simplicity ofarcade mechanics. Think of Pac-Man. Pure addictive fun that stands for decades. When the core is fun, the game doesn't need a fancy package. So sometimes, the best online games are the ones that are easy on the eyes, quick to learn, and instantly fun to play.\nUltimate Motowas created exactly with this kind of mentality. This game strips gaming back down to the basics with its minimalist neon visuals, sharp and clean lines, and easy mechanics. Forget 5 different kinds of in-game coins, menus packed with hundreds of confusing options, endless tutorials, or overly complex storylines. Here, it's all about getting right onto the neon-lit track and controlling your bike with arrow keys. And enjoying smooth jumps and satisfying flips.\nIf you're looking for a break from the gaming clutter, Ultimate Moto provides what you've been looking for. This fun little game throws you into a glowing track full of loops, ramps, and sparkly gems to collect. Choose your bike, upgrade your engine, and zoom through challenging levels with style. Each level is a new obstacle course, and your goal is to stay upright on the bike. Hit start, speed ahead, and reach the finish line without crashing.\nYour mission is to reach the finish line without tipping over. Along the way, grab as many diamonds as you can. These gems are your currency to buy new bikes and engine upgrades. Each level gets a bit trickier, with steeper hills, longer jumps, and tighter timing. If you flip in the air, you get an extra three diamonds. And if you crash, just restart instantly and try that level again.\nWASD or arrow keys to move.\nUltimate Moto is developed by FreezeNova Games and released in 2021.\nIf Ultimate Moto brings back that feeling for you, let us know! Drop a comment, tell us how far you've made it, or which neon bike is your favorite. We'd love to hear your thoughts. And if you enjoyed Ultimate Moto, have a look at the otherfree bike gameswe have on OnlineGames.io . We publish new games each week. So bookmark this site and don't miss out on new games.Â",
        "short_description": "Race through glowing tracks in Ultimate Moto, free online bike game on OnlineGames.io!",
        "page_filename": "ultimatemoto.html"
    }
]